qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Freescale/TARGET_KLXX/TARGET_KL25Z/MKL25Z4.h
/** UARTLP - Register Layout Typedef */
typedef struct {
  __IO uint8_t BDH;                                /**< UART Baud Rate Register High, offset: 0x0 */
  __IO uint8_t BDL;                                /**< UART Baud Rate Register Low, offset: 0x1 */
  __IO uint8_t C1;                                 /**< UART Control Register 1, offset: 0x2 */
  __IO uint8_t C2;                                 /**< UART Control Register 2, offset: 0x3 */
  __IO uint8_t S1;                                 /**< UART Status Register 1, offset: 0x4 */
  __IO uint8_t S2;                                 /**< UART Status Register 2, offset: 0x5 */
  __IO uint8_t C3;                                 /**< UART Control Register 3, offset: 0x6 */
  __IO uint8_t D;                                  /**< UART Data Register, offset: 0x7 */
  __IO uint8_t MA1;                                /**< UART Match Address Registers 1, offset: 0x8 */
  __IO uint8_t MA2;                                /**< UART Match Address Registers 2, offset: 0x9 */
  __IO uint8_t C4;                                 /**< UART Control Register 4, offset: 0xA */
  __IO uint8_t C5;                                 /**< UART Control Register 5, offset: 0xB */
} UARTLP_Type;

/* ----------------------------------------------------------------------------
   -- UARTLP Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UARTLP_Register_Masks UARTLP Register Masks
 * @{
 */

/* BDH Bit Fields */
#define UARTLP_BDH_SBR_MASK                      0x1Fu
#define UARTLP_BDH_SBR_SHIFT                     0
#define UARTLP_BDH_SBR(x)                        (((uint8_t)(((uint8_t)(x))<<UARTLP_BDH_SBR_SHIFT))&UARTLP_BDH_SBR_MASK)
#define UARTLP_BDH_SBNS_MASK                     0x20u
#define UARTLP_BDH_SBNS_SHIFT                    5
#define UARTLP_BDH_RXEDGIE_MASK                  0x40u
#define UARTLP_BDH_RXEDGIE_SHIFT                 6
#define UARTLP_BDH_LBKDIE_MASK                   0x80u
#define UARTLP_BDH_LBKDIE_SHIFT                  7
/* BDL Bit Fields */
#define UARTLP_BDL_SBR_MASK                      0xFFu
#define UARTLP_BDL_SBR_SHIFT                     0
#define UARTLP_BDL_SBR(x)                        (((uint8_t)(((uint8_t)(x))<<UARTLP_BDL_SBR_SHIFT))&UARTLP_BDL_SBR_MASK)
/* C1 Bit Fields */
#define UARTLP_C1_PT_MASK                        0x1u
#define UARTLP_C1_PT_SHIFT                       0
#define UARTLP_C1_PE_MASK                        0x2u
#define UARTLP_C1_PE_SHIFT                       1
#define UARTLP_C1_ILT_MASK                       0x4u
#define UARTLP_C1_ILT_SHIFT                      2
#define UARTLP_C1_WAKE_MASK                      0x8u
#define UARTLP_C1_WAKE_SHIFT                     3
#define UARTLP_C1_M_MASK                         0x10u
#define UARTLP_C1_M_SHIFT                        4
#define UARTLP_C1_RSRC_MASK                      0x20u
#define UARTLP_C1_RSRC_SHIFT                     5
#define UARTLP_C1_DOZEEN_MASK                    0x40u
#define UARTLP_C1_DOZEEN_SHIFT                   6
#define UARTLP_C1_LOOPS_MASK                     0x80u
#define UARTLP_C1_LOOPS_SHIFT                    7
/* C2 Bit Fields */
#define UARTLP_C2_SBK_MASK                       0x1u
#define UARTLP_C2_SBK_SHIFT                      0
#define UARTLP_C2_RWU_MASK                       0x2u
#define UARTLP_C2_RWU_SHIFT                      1
#define UARTLP_C2_RE_MASK                        0x4u
#define UARTLP_C2_RE_SHIFT                       2
#define UARTLP_C2_TE_MASK                        0x8u
#define UARTLP_C2_TE_SHIFT                       3
#define UARTLP_C2_ILIE_MASK                      0x10u
#define UARTLP_C2_ILIE_SHIFT                     4
#define UARTLP_C2_RIE_MASK                       0x20u
#define UARTLP_C2_RIE_SHIFT                      5
#define UARTLP_C2_TCIE_MASK                      0x40u
#define UARTLP_C2_TCIE_SHIFT                     6
#define UARTLP_C2_TIE_MASK                       0x80u
#define UARTLP_C2_TIE_SHIFT                      7
/* S1 Bit Fields */
#define UARTLP_S1_PF_MASK                        0x1u
#define UARTLP_S1_PF_SHIFT                       0
#define UARTLP_S1_FE_MASK                        0x2u
#define UARTLP_S1_FE_SHIFT                       1
#define UARTLP_S1_NF_MASK                        0x4u
#define UARTLP_S1_NF_SHIFT                       2
#define UARTLP_S1_OR_MASK                        0x8u
#define UARTLP_S1_OR_SHIFT                       3
#define UARTLP_S1_IDLE_MASK                      0x10u
#define UARTLP_S1_IDLE_SHIFT                     4
#define UARTLP_S1_RDRF_MASK                      0x20u
#define UARTLP_S1_RDRF_SHIFT                     5
#define UARTLP_S1_TC_MASK                        0x40u
#define UARTLP_S1_TC_SHIFT                       6
#define UARTLP_S1_TDRE_MASK                      0x80u
#define UARTLP_S1_TDRE_SHIFT                     7
/* S2 Bit Fields */
#define UARTLP_S2_RAF_MASK                       0x1u
#define UARTLP_S2_RAF_SHIFT                      0
#define UARTLP_S2_LBKDE_MASK                     0x2u
#define UARTLP_S2_LBKDE_SHIFT                    1
#define UARTLP_S2_BRK13_MASK                     0x4u
#define UARTLP_S2_BRK13_SHIFT                    2
#define UARTLP_S2_RWUID_MASK                     0x8u
#define UARTLP_S2_RWUID_SHIFT                    3
#define UARTLP_S2_RXINV_MASK                     0x10u
#define UARTLP_S2_RXINV_SHIFT                    4
#define UARTLP_S2_MSBF_MASK                      0x20u
#define UARTLP_S2_MSBF_SHIFT                     5
#define UARTLP_S2_RXEDGIF_MASK                   0x40u
#define UARTLP_S2_RXEDGIF_SHIFT                  6
#define UARTLP_S2_LBKDIF_MASK                    0x80u
#define UARTLP_S2_LBKDIF_SHIFT                   7
/* C3 Bit Fields */
#define UARTLP_C3_PEIE_MASK                      0x1u
#define UARTLP_C3_PEIE_SHIFT                     0
#define UARTLP_C3_FEIE_MASK                      0x2u
#define UARTLP_C3_FEIE_SHIFT                     1
#define UARTLP_C3_NEIE_MASK                      0x4u
#define UARTLP_C3_NEIE_SHIFT                     2
#define UARTLP_C3_ORIE_MASK                      0x8u
#define UARTLP_C3_ORIE_SHIFT                     3
#define UARTLP_C3_TXINV_MASK                     0x10u
#define UARTLP_C3_TXINV_SHIFT                    4
#define UARTLP_C3_TXDIR_MASK                     0x20u
#define UARTLP_C3_TXDIR_SHIFT                    5
#define UARTLP_C3_R9T8_MASK                      0x40u
#define UARTLP_C3_R9T8_SHIFT                     6
#define UARTLP_C3_R8T9_MASK                      0x80u
#define UARTLP_C3_R8T9_SHIFT                     7
/* D Bit Fields */
#define UARTLP_D_R0T0_MASK                       0x1u
#define UARTLP_D_R0T0_SHIFT                      0
#define UARTLP_D_R1T1_MASK                       0x2u
#define UARTLP_D_R1T1_SHIFT                      1
#define UARTLP_D_R2T2_MASK                       0x4u
#define UARTLP_D_R2T2_SHIFT                      2
#define UARTLP_D_R3T3_MASK                       0x8u
#define UARTLP_D_R3T3_SHIFT                      3
#define UARTLP_D_R4T4_MASK                       0x10u
#define UARTLP_D_R4T4_SHIFT                      4
#define UARTLP_D_R5T5_MASK                       0x20u
#define UARTLP_D_R5T5_SHIFT                      5
#define UARTLP_D_R6T6_MASK                       0x40u
#define UARTLP_D_R6T6_SHIFT                      6
#define UARTLP_D_R7T7_MASK                       0x80u
#define UARTLP_D_R7T7_SHIFT                      7
/* MA1 Bit Fields */
#define UARTLP_MA1_MA_MASK                       0xFFu
#define UARTLP_MA1_MA_SHIFT                      0
#define UARTLP_MA1_MA(x)                         (((uint8_t)(((uint8_t)(x))<<UARTLP_MA1_MA_SHIFT))&UARTLP_MA1_MA_MASK)
/* MA2 Bit Fields */
#define UARTLP_MA2_MA_MASK                       0xFFu
#define UARTLP_MA2_MA_SHIFT                      0
#define UARTLP_MA2_MA(x)                         (((uint8_t)(((uint8_t)(x))<<UARTLP_MA2_MA_SHIFT))&UARTLP_MA2_MA_MASK)
/* C4 Bit Fields */
#define UARTLP_C4_OSR_MASK                       0x1Fu
#define UARTLP_C4_OSR_SHIFT                      0
#define UARTLP_C4_OSR(x)                         (((uint8_t)(((uint8_t)(x))<<UARTLP_C4_OSR_SHIFT))&UARTLP_C4_OSR_MASK)
#define UARTLP_C4_M10_MASK                       0x20u
#define UARTLP_C4_M10_SHIFT                      5
#define UARTLP_C4_MAEN2_MASK                     0x40u
#define UARTLP_C4_MAEN2_SHIFT                    6
#define UARTLP_C4_MAEN1_MASK                     0x80u
#define UARTLP_C4_MAEN1_SHIFT                    7
/* C5 Bit Fields */
#define UARTLP_C5_RESYNCDIS_MASK                 0x1u
#define UARTLP_C5_RESYNCDIS_SHIFT                0
#define UARTLP_C5_BOTHEDGE_MASK                  0x2u
#define UARTLP_C5_BOTHEDGE_SHIFT                 1
#define UARTLP_C5_RDMAE_MASK                     0x20u
#define UARTLP_C5_RDMAE_SHIFT                    5
#define UARTLP_C5_TDMAE_MASK                     0x80u
#define UARTLP_C5_TDMAE_SHIFT                    7

/**
 * @}
 */ /* end of group UARTLP_Register_Masks */


/* UARTLP - Peripheral instance base addresses */
/** Peripheral UART0 base address */
#define UART0_BASE                               (0x4006A000u)
/** Peripheral UART0 base pointer */
#define UART0                                    ((UARTLP_Type *)UART0_BASE)
/** Array initializer of UARTLP peripheral base pointers */
#define UARTLP_BASES                             { UART0 }

/**
 * @}
 */ /* end of group UARTLP_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- USB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USB_Peripheral_Access_Layer USB Peripheral Access Layer
 * @{
 */

/** USB - Register Layout Typedef */
typedef struct {
  __I  uint8_t PERID;                              /**< Peripheral ID register, offset: 0x0 */
       uint8_t RESERVED_0[3];
  __I  uint8_t IDCOMP;                             /**< Peripheral ID Complement register, offset: 0x4 */
       uint8_t RESERVED_1[3];
  __I  uint8_t REV;                                /**< Peripheral Revision register, offset: 0x8 */
       uint8_t RESERVED_2[3];
  __I  uint8_t ADDINFO;                            /**< Peripheral Additional Info register, offset: 0xC */
       uint8_t RESERVED_3[3];
  __IO uint8_t OTGISTAT;                           /**< OTG Interrupt Status register, offset: 0x10 */
       uint8_t RESERVED_4[3];
  __IO uint8_t OTGICR;                             /**< OTG Interrupt Control Register, offset: 0x14 */
       uint8_t RESERVED_5[3];
  __IO uint8_t OTGSTAT;                            /**< OTG Status register, offset: 0x18 */
       uint8_t RESERVED_6[3];
  __IO uint8_t OTGCTL;                             /**< OTG Control register, offset: 0x1C */
       uint8_t RESERVED_7[99];
  __IO uint8_t ISTAT;                              /**< Interrupt Status register, offset: 0x80 */
       uint8_t RESERVED_8[3];
  __IO uint8_t INTEN;                              /**< Interrupt Enable register, offset: 0x84 */
       uint8_t RESERVED_9[3];
  __IO uint8_t ERRSTAT;                            /**< Error Interrupt Status register, offset: 0x88 */
       uint8_t RESERVED_10[3];
  __IO uint8_t ERREN;                              /**< Error Interrupt Enable register, offset: 0x8C */
       uint8_t RESERVED_11[3];
  __I  uint8_t STAT;                               /**< Status register, offset: 0x90 */
       uint8_t RESERVED_12[3];
  __IO uint8_t CTL;                                /**< Control register, offset: 0x94 */
       uint8_t RESERVED_13[3];
  __IO uint8_t ADDR;                               /**< Address register, offset: 0x98 */
       uint8_t RESERVED_14[3];
  __IO uint8_t BDTPAGE1;                           /**< BDT Page Register 1, offset: 0x9C */
       uint8_t RESERVED_15[3];
  __IO uint8_t FRMNUML;                            /**< Frame Number Register Low, offset: 0xA0 */
       uint8_t RESERVED_16[3];
  __IO uint8_t FRMNUMH;                            /**< Frame Number Register High, offset: 0xA4 */
       uint8_t RESERVED_17[3];
  __IO uint8_t TOKEN;                              /**< Token register, offset: 0xA8 */
       uint8_t RESERVED_18[3];
  __IO uint8_t SOFTHLD;                            /**< SOF Threshold Register, offset: 0xAC */
       uint8_t RESERVED_19[3];
  __IO uint8_t BDTPAGE2;                           /**< BDT Page Register 2, offset: 0xB0 */
       uint8_t RESERVED_20[3];
  __IO uint8_t BDTPAGE3;                           /**< BDT Page Register 3, offset: 0xB4 */
       uint8_t RESERVED_21[11];
  struct {                                         /* offset: 0xC0, array step: 0x4 */
    __IO uint8_t ENDPT;                              /**< Endpoint Control register, array offset: 0xC0, array step: 0x4 */
         uint8_t RESERVED_0[3];
  } ENDPOINT[16];
  __IO uint8_t USBCTRL;                            /**< USB Control register, offset: 0x100 */
       uint8_t RESERVED_22[3];
  __I  uint8_t OBSERVE;                            /**< USB OTG Observe register, offset: 0x104 */
       uint8_t RESERVED_23[3];
  __IO uint8_t CONTROL;                            /**< USB OTG Control register, offset: 0x108 */
       uint8_t RESERVED_24[3];
  __IO uint8_t USBTRC0;                            /**< USB Transceiver Control Register 0, offset: 0x10C */
} USB_Type;

/* ----------------------------------------------------------------------------
   -- USB Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup USB_Register_Masks USB Register Masks
 * @{
 */

